Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you open up link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart/src/test/java/org/acme/funqy/FunqyTest.java[FunqyTest.java] you'll see that the test replicates the AWS execution environment.
ja_jp: link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart/src/test/java/org/acme/funqy/FunqyTest.java[FunqyTest.java] を開くと、AWS 実行環境を複製したテストであることがわかります。

source: If you open up {quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart/src/test/java/org/acme/funqy/FunqyTest.java[FunqyTest.java] you'll see that the test replicates the AWS execution environment.
ja_jp: {quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart/src/test/java/org/acme/funqy/FunqyTest.java[FunqyTest.java] を開いてみると、AWS 実行環境を複製したテストであることがわかると思います。

source: If you opened the generated `pom.xml`, you would see that the `quarkus-smallrye-reactive-messaging-amqp` and `quarkus-resteasy-jackson` dependencies are declared, so we're ready to write some code.
ja_jp: 生成された `pom.xml` を開くと、 `quarkus-smallrye-reactive-messaging-amqp` と `quarkus-resteasy-jackson` の依存関係が宣言されていることがわかります。なのでコードを書く準備が出来ています。

source: If you opened the generated `pom.xml`, you would see that the `quarkus-smallrye-reactive-messaging-kafka` and `quarkus-resteasy-jackson` dependencies are declared, so we're ready to write some code.
ja_jp: 生成された `pom.xml` を開くと、 `quarkus-smallrye-reactive-messaging-kafka` と `quarkus-resteasy-jackson` の依存関係が宣言されていることがわかります。

source: If you plan on running the application via Docker, then you'll need to add `-e QUARKUS_LAUNCH_DEVMODE=true` to the `docker run` command. When the application starts you should now see the following line in the logs: `Profile dev activated. Live Coding activated`.
ja_jp: アプリケーションをdocker経由で実行する場合は、 `docker run` コマンドに `-e QUARKUS_LAUNCH_DEVMODE=true` を追加してイメージを起動します。アプリケーションが起動すると、ログに次のような行が表示されるはずです: `Profile dev activated. Live Coding activated` .

source: If you plan on running the application via Docker, then you'll need to add `-e QUARKUS_LAUNCH_DEVMODE=true` to the `docker run` command. When the application starts you should now see the following line in the logs: `Profile dev activated. Live Coding activated`. You will also need to give the application the rights to update the deployment resources by adding `RUN chmod o+rw -R /deployments` after the `COPY` commands into your Dockerfile. For security reasons, this option should not be added to the production Dockerfile.
ja_jp: Docker 経由でアプリケーションを実行する予定の場合は、 `docker run` コマンドに `-e QUARKUS_LAUNCH_DEVMODE=true` を追加する必要があります。 アプリケーションが起動すると、ログに `Profile dev activated. Live Coding activated` の行が表示されます。また、Dockerfile の `COPY` コマンドの後に `RUN chmod o+rw -R /deployments` を追加して、アプリケーションにデプロイメントリソースの更新権限を付与する必要があります。セキュリティー上の理由から、このオプションは実稼働環境の Dockerfile には追加しないでください。

source: If you plan on using a different setup, please change your `application.properties` accordingly.
ja_jp: 別のセットアップを使用する予定の場合は、それに合わせて `application.properties` を変更してください。

source: If you plan to consume this application from a Single Page Application running on a different domain, you will need to configure CORS (Cross-Origin Resource Sharing). Please read the xref:http-reference.adoc#cors-filter[HTTP CORS documentation] for more details.
ja_jp: 別のドメインで動作する Single Page Application からこのアプリケーションを利用する場合は、CORS (Cross-Origin Resource Sharing) を設定する必要があります。詳細については、 link:http-reference.html#cors-filter[HTTP CORSのドキュメント]を参照してください。

source: If you plan to consume this application from a Single Page Application running on a different domain, you will need to configure CORS (Cross-Origin Resource Sharing). Please read the xref:security-cors.adoc#cors-filter[CORS filter] section of the "Cross-origin resource sharing" guide for more details.
ja_jp: 別のドメインで実行されているシングルページのアプリケーションからこのアプリケーションを利用する場合は、CORS (クロスオリジンリソース共有) を設定する必要があります。 詳細は、「クロスオリジンリソース共有」ガイドの xref:security-cors.adoc#cors-filter[CORS フィルター] セクションを参照してください。

source: If you plan to consume this application from a single-page application running on a different domain, you need to configure cross-origin resource sharing (CORS).
ja_jp: 別のドメインで実行されているシングルページのアプリケーションからこのアプリケーションを利用する場合は、クロスオリジンリソース共有 (CORS) を設定する必要があります。

source: If you plan to consume this application from a single-page application running on a different domain, you need to configure cross-origin resource sharing (CORS). For more information, see the xref:security-cors.adoc#cors-filter[CORS filter] section of the "Cross-origin resource sharing" guide.
ja_jp: 別のドメインで実行されているシングルページのアプリケーションからこのアプリケーションを利用する場合は、クロスオリジンリソース共有（CORS）を設定する必要があります。 詳細については、「クロスオリジンリソース共有」ガイドの xref:security-cors.adoc#cors-filter[CORSフィルター] のセクションを参照してください。

source: If you plan to consume your OpenID Connect `service` application from a Single Page Application running on a different domain, you will need to configure CORS (Cross-Origin Resource Sharing). Please read the xref:http-reference.adoc#cors-filter[HTTP CORS documentation] for more details.
ja_jp: 別のドメインで動作する Single Page Application から OpenID Connect `service` アプリケーションを利用する場合は、CORS (Cross-Origin Resource Sharing) を設定する必要があります。詳細については、 link:http-reference.html#cors-filter[HTTP CORSのドキュメント]を参照してください。

source: If you plan to make a native executable, we recommend you use the existing JDBC Quarkus extensions (or contribute one for your driver).
ja_jp: ネイティブ実行可能ファイルを作成する場合は、既存の JDBC Quarkus エクステンションを使用するこが推奨されます (または、ドライバーに貢献することをお勧めします)。

source: If you plan to make your Quarkus application accessible to another application running on a different domain, you will need to configure CORS (Cross-Origin Resource Sharing). Please read the xref:http-reference.adoc#cors-filter[HTTP CORS documentation] for more information.
ja_jp: Quarkus アプリケーションを異なるドメインで実行している別のアプリケーションにアクセスできるようにする場合は、CORS (Cross-Origin Resource Sharing) を設定する必要があります。詳細は、xref:http-reference.adoc#cors-filter[HTTP CORS documentation] を参照してください。

source: If you plan to run such integration tests in the JVM exclusively, it will of course work as usual.
ja_jp: このような統合テストを JVM で排他的に実行する予定であれば、もちろん通常通りに動作します。

source: If you plan to use external modules (for example, an external library for all your domain objects), you will need to make these modules known to the indexing process either by adding the Jandex plugin (if you can modify them) or via the `quarkus.index-dependency` property inside your `application.properties` (useful in cases where you can't modify the module).
ja_jp: 外部モジュール (例えば、すべてのドメインオブジェクトのための外部ライブラリ) を使用する予定がある場合は、Jandex プラグインを追加するか (変更できる場合)、 `application.properties` 内の `quarkus.index-dependency` プロパティーを使って (モジュールを変更できない場合に便利です)、これらのモジュールをインデックス作成プロセスに知らせておく必要があります。

source: If you plan to use standard security annotations on the IO thread, review the information in xref:security-proactive-authentication.adoc[Proactive Authentication].
ja_jp: IO スレッドで標準のセキュリティーアノテーションを使用する予定の場合は、xref:security-proactive-authentication.adoc[Proactive Authentication] の情報を確認してください。

source: If you plan to use the `@PermissionsAllowed` on the IO thread, review the information in xref:security-proactive-authentication.adoc[Proactive Authentication].
ja_jp: IO スレッドで `@PermissionsAllowed` を使用する予定の場合は xref:security-proactive-authentication.adoc[Proactive Authentication] の情報を確認してください。

source: If you plan to use your OIDC `service` application from a single-page application running on a different domain, you must configure cross-origin resource sharing (CORS). For more information, see the xref:security-cors.adoc#cors-filter[CORS filter] section of the "Cross-origin resource sharing" guide.
ja_jp: 別のドメインで実行されているシングルページアプリケーションから OIDC `service` アプリケーションを使用する予定の場合は、クロスオリジンリソース共有 (CORS) を設定する必要があります。 詳細は、「クロスオリジンリソース共有」ガイドの xref:security-cors.adoc#cors-filter[CORS フィルター] セクションを参照してください。

source: If you play with your code some more, you may notice that sometimes, after making an application change, http://localhost:8080/hello/names doesn't list any names. What's going on? By default, in dev mode, with a Dev Services database, Quarkus configures Hibernate ORM database generation to be `drop-and-create`. See the xref:hibernate-orm.adoc#quarkus-hibernate-orm_quarkus-hibernate-orm-database-generation[Hibernate configuration reference] for more details. If a code change triggers an application restart, the database tables will be dropped (deleted) and then re-created.
ja_jp: コードをもう少しいじってみると、アプリケーションを変更した後、 http://localhost:8080/hello/names に名前が表示されない場合があることに気付くかもしれません。 何が起こっているのでしょうか? デフォルトでは、開発モードでは、Dev Services データベースを使用して、 Quarkus は、Hibernate ORM データベース生成を `drop-and-create` に設定します。 詳細は、xref:hibernate-orm.adoc#quarkus-hibernate-orm_quarkus-hibernate-orm-database-generation[Hibernate 設定リファレンス] を参照してください。 コードの変更によりアプリケーションの再起動がトリガーされると、データベーステーブルは ドロップ (削除) されてから再作成されます。

source: If you play with your code some more, you may notice that sometimes, after making an application change, http://localhost:8080/hello/names doesn't list any names. What's going on? By default, in dev mode, with a Dev Services database, Quarkus configures Hibernate ORM database schema management strategy to be `drop-and-create`. See the xref:hibernate-orm.adoc#quarkus-hibernate-orm_quarkus-hibernate-orm-schema-management-strategy[Hibernate configuration reference] for more details. If a code change triggers an application restart, the database tables will be dropped (deleted) and then re-created.
ja_jp: コードをもう少し試してみると、アプリケーションを変更した後、 http://localhost:8080/hello/names に名前が表示されないことがあることに気づくかもしれません。何が起こっているのでしょうか? デフォルトでは、開発モードで Dev Services データベースを使用している場合、Quarkus は、Hibernate ORM のデータベーススキーマ管理戦略を `drop-and-create` に設定します。詳細は、xref:hibernate-orm.adoc#quarkus-hibernate-orm_quarkus-hibernate-orm-schema-management-strategy[Hibernate 設定リファレンス] を参照してください。コードの変更によりアプリケーションの再起動がトリガーされると、データベーステーブルはドロップ (削除) され、その後再作成されます。

source: If you prefer a programmatic configuration, the same mapping can be added with the `io.quarkus.vertx.http.security.HttpSecurity` CDI event:
ja_jp: プログラムによる設定を希望する場合は、同じマッピングを `io.quarkus.vertx.http.security.HttpSecurity` CDI イベントで追加できます:

source: If you prefer an OpenMetrics export rather than the JSON format, remove the `-H"Accept: application/json"` argument from your command line.
ja_jp: JSON形式ではなくOpenMetricsのエクスポートを希望する場合は、コマンドラインから `-H"Accept: application/json"` 引数を削除してください。

source: If you prefer human-readable, unstructured logging in dev mode and JSON-structured logging in production mode, configure this by using profiles, as shown in the following configuration.
ja_jp: 開発モードでは人間が読める構造化されていないロギングを使用し、本番モードでは JSON 構造化ロギングを使用したい場合は、以下の設定のようにプロファイルを使用して設定してください。

source: If you prefer not to have a Dev Services for Keycloak container started or do not work with Keycloak, then you can also disable this feature with `quarkus.keycloak.devservices.enabled=false` - it is only necessary if you expect to start `quarkus:dev` without `quarkus.oidc.auth-server-url`.
ja_jp: Dev Services for Keycloak コンテナーを起動させない、または使用しない場合も、`quarkus.keycloak.devservices.enabled=false` を使用してこの機能を無効化できます。これは、`quarkus.oidc.auth-server-url` なしで `quarkus:dev` を起動する予定がある場合にのみ必要です。

source: If you prefer not to have a `Dev Services for Keycloak` container started or do not work with Keycloak then you can also disable this feature with `quarkus.keycloak.devservices.enabled=false` - it will only be necessary if you expect to start `quarkus:dev` without `quarkus.oidc.auth-server-url`.
ja_jp: `Dev Services for Keycloak` コンテナーを起動させない、または使用しない場合も、 `quarkus.keycloak.devservices.enabled=false` を使用してこの機能を無効化できます。これは、 `quarkus.oidc.auth-server-url` なしで `quarkus:dev` を起動する予定がある場合にのみ必要です。

source: If you prefer not to use the command line, manually add the dependency to your build file:
ja_jp: コマンドラインを使用したくない場合は、ビルドファイルに依存関係を手動で追加します。

source: If you prefer the users to re-authenticate after some rather long idle period of time, consider configuring `quarkus.oidc.authentication.session-expired-path` instead, see below for more details.
ja_jp: かなり長いアイドル期間の後にユーザーに再認証させたい場合は、代わりに `quarkus.oidc.authentication.session-expired-path` を設定することを検討してください。詳細は以下を参照してください。

source: If you prefer to compare the CSRF form field and cookie values in the application code then you can do it as follows:
ja_jp: もし、CSRFのフォームフィールドとクッキーの値をアプリケーションのコードで比較したい場合は、次のようにします。

source: If you prefer to configure the issuer programmatically, set `mp.jwt.verify.issuer` to `NONE` to prevent the default value from being applied.
ja_jp: 発行者をプログラムで設定したい場合は、デフォルト値が適用されないように `mp.jwt.verify.issuer` を `NONE` に設定します。

source: If you prefer to follow a stateful token storage strategy, you can use a custom `TokenStateManager` provided by Quarkus to have your application store tokens in a database, instead of storing them in an encrypted session cookie, which is done by default as described in the <<token-state-manager>> section.
ja_jp: ステートフルなトークンストレージストラテジーを採用したい場合は、Quarkus が提供するカスタムの `TokenStateManager` を使用して、アプリケーションがトークンを暗号化されたセッションクッキーに保存するのではなく、データベースに保存することができます。これは、<<token-state-manager>> セクションに記載されているとおり、デフォルトで設定されています。

source: If you prefer to use Gradle, you can quickly and easily generate a Gradle project via https://code.quarkus.io/[code.quarkus.io] adding the `quarkus-amazon-lambda` extension as a dependency.
ja_jp: Gradleを使いたい場合は、 link:https://code.quarkus.io/[code.quarkus.io] を使って、 `quarkus-amazon-lambda` エクステンションを依存関係として追加することで、素早く簡単にGradleプロジェクトを生成することができます。

source: If you prefer to use SPA and JavaScript API such as `Fetch` or `XMLHttpRequest`(XHR) with Quarkus web applications, please be aware that OpenID Connect Providers may not support CORS for Authorization endpoints where the users are authenticated after a redirect from Quarkus. This will lead to authentication failures if the Quarkus application and the OpenID Connect Provider are hosted on the different HTTP domains/ports.
ja_jp: Quarkus Web アプリケーションで SPA や、 `Fetch` または `XMLHttpRequest`(XHR) などの JavaScript API を使用する場合は、OpenID Connect Provider が、Quarkus からのリダイレクト後にユーザーが認証される認証エンドポイントの CORS をサポートしない場合があることに注意してください。Quarkus アプリケーションと OpenID Connect Provider が異なる HTTP ドメイン/ポートでホストされている場合、認証に失敗することになります。

source: If you prefer to use SPAs and JavaScript APIs such as `Fetch` or `XMLHttpRequest`(XHR) with Quarkus web applications, be aware that OIDC providers might not support cross-origin resource sharing (CORS) for authorization endpoints where the users are authenticated after a redirect from Quarkus. This will lead to authentication failures if the Quarkus application and the OIDC provider are hosted on different HTTP domains, ports, or both.
ja_jp: Quarkus Web アプリケーションで `Fetch` や `XMLHttpRequest`(XHR) などの SPA および JavaScript API を使用する場合は、Quarkus からのリダイレクト後にユーザーが認証される認可エンドポイントに対して、OIDC プロバイダーがクロスオリジンリソース共有 (CORS) をサポートしない可能性があることに注意してください。 Quarkus アプリケーションと OIDC プロバイダーが異なる HTTP ドメイン、ポート、またはその両方でホストされている場合、認証に失敗します。

source: If you prefer to use Spring Boot `@ConfigurationProperties` annotated class to access application properties instead of <<config-mappings.adoc#config-mappings,`@ConfigMapping`>> or a MicroProfile `@ConfigProperty` approach, you can do that with this extension.
ja_jp: <<config-mappings.adoc#config-mappings,`@ConfigMapping`>> や MicroProfile `@ConfigProperty` のアプローチではなく、Spring Boot `@ConfigurationProperties` アノテーションクラスを使用してアプリケーションのプロパティーにアクセスしたい場合は、このエクステンションを使用することができます。

source: If you prefer to use Spring Boot `@ConfigurationProperties` annotated class to access application properties instead of a Quarkus native `@ConfigProperties` or a MicroProfile `@ConfigProperty` approach, you can do that with this extension.
ja_jp: Quarkusネイティブの `@ConfigProperties` や MicroProfile `@ConfigProperty` のアプローチではなく、Spring Boot `@ConfigurationProperties` アノテーションクラスを使用してアプリケーションのプロパティーにアクセスしたい場合は、このエクステンションを使用することができます。

source: If you prefer to use Spring Boot `@ConfigurationProperties` annotated class to access application properties instead of xref:config-mappings.adoc#config-mappings[`@ConfigMapping`] or a MicroProfile `@ConfigProperty` approach, you can do that with this extension.
ja_jp: <<config-mappings.adoc#config-mappings,`@ConfigMapping`>> や MicroProfile `@ConfigProperty` のアプローチではなく、Spring Boot `@ConfigurationProperties` アノテーションクラスを使用してアプリケーションのプロパティーにアクセスしたい場合は、このエクステンションを使用することができます。

source: If you prefer to use a standalone Gradle installation, please use Gradle {gradle-version}.
ja_jp: スタンドアロンの Gradle インストールを使用する場合は、Gradle {gradle-version} を使用します。

source: If you prefer using Reactive Stream APIs, you can use `MutinyEmitter` that will return `Uni<Void>` from the `send` method. You can therefore use Mutiny APIs for handling downstream messages and errors.
ja_jp: Reactive Stream API を使いたい場合は、 `send` メソッドから `Uni<Void>` を返す `MutinyEmitter` を使用できます。 これにより、Mutiny API を使用してダウンストリームのメッセージとエラーを処理できます。

source: If you prefer using a reactive datasource, Quarkus offers DB2, MariaDB/MySQL, Microsoft SQL Server, Oracle and PostgreSQL reactive clients.
ja_jp: リアクティブデータソースを使用したい場合は、Quarkus では、DB2、MySQL/MariaDB、PostgreSQL リアクティブクライアントを利用できます。

source: If you prefer using the Kotlin DSL, use `gradle-kotlin-dsl` instead of `gradle`.
ja_jp: Kotlin DSLを使用したい場合は、 `gradle` の代わりに `gradle-kotlin-dsl` を使用してください。

source: If you prefer you can use your own custom filter and inject `Tokens`:
ja_jp: ご希望の場合は、独自のカスタムフィルターを使用して、 `Tokens` を注入することができます。

source: If you prefer, you can use your own custom filter and inject `Tokens`:
ja_jp: ご希望の場合は、独自のカスタムフィルターを使用して、 `Tokens` を注入することができます。

source: If you provide user credentials, the underlying database will be configured to use them. This is useful if you want to connect to the database with an external tool.
ja_jp: ユーザークレデンシャルを指定すると、基礎となるデータベースはそのクレデンシャルを使用するように設定されます。 これは、外部ツールでデータベースに接続したい場合に便利です。

source: If you really do want to reference beans using a string value in configuration properties know that string is parsed; here are the most common formats:
ja_jp: 設定プロパティーで文字列値を使用して Bean を参照したい場合は、 文字列が解析されることを確認します。最も一般的な形式は次のとおりです。

source: If you really need to use an expression which can potentially lead to a "not found" error, you can use _default values_ and _safe expressions_ in order to suppress the error. A default value is used if the previous part of an expression cannot be resolved or resolves to `null`. You can use the elvis operator to output the default value: `{foo.bar ?: 'baz'}`, which is effectively the same as the following virtual method: `{foo.bar.or('baz')}`. A safe expression ends with the `??` suffix and results in `null` if the expression cannot be resolved. It can be very useful e.g. in `{#if}` sections: `{#if valueNotFound??}Only rendered if valueNotFound is truthy!{/if}`. In fact, `??` is just a shorthand notation for `.or(null)`, i.e. `{#if valueNotFound??}` becomes `{#if valueNotFound.or(null)}`.
ja_jp: "not found" エラーを引き起こす可能性のある式をどうしても使いたい場合は、_デフォルト値_ および _安全な式_ を使ってエラーを抑制することができます。 デフォルト値は、式の前のパーツが解決できないか、`null` に解決される場合に使用されます。 エルビス演算子を使ってデフォルト値 `{foo.bar ?: 'baz'}` を出力することができます。 これは事実上、仮想メソッド `{foo.bar.or('baz')}` と同じになります。安全な式は `??` という接尾辞で終わり、式が解決できない場合は `null` という結果になります。 これは、`{#if valueNotFound??}Only rendered if valueNotFound is truthy!{/if}` セクションの `{#if}` などで非常に便利です。 実際のところ、`??` は `.or(null)` の簡単な表記法に過ぎず、たとえば `{#if valueNotFound??}` は `{#if valueNotFound.or(null)}` となります。

source: If you recall, when the application was started in dev mode, the following could be seen in the CLI window:
ja_jp: アプリケーションを開発モードで起動すると、CLI ウィンドウに次のように表示されます。

source: If you redefine the same variable by using the new syntax while keeping the old syntax, only the new version is kept, and a warning will be issued to alert you of the problem. For example, if you define both `quarkus.openshift.env-vars.my-env-var.value=foobar` and `quarkus.openshift.env.vars.my-env-var=newValue`, the extension generates an environment variable `MY_ENV_VAR=newValue` and issues a warning.
ja_jp: 古い構文を保持したまま新しい構文を使用して同じ変数を再定義すると、新しいバージョンだけが保持され、問題を警告します。 例えば、 `quarkus.openshift.env-vars.my-env-var.value=foobar` と `quarkus.openshift.env.vars.my-env-var=newValue` の両方を定義した場合、拡張機能は環境変数 `MY_ENV_VAR=newValue` を生成し、警告を発します。

source: If you redefine the same variable using the new syntax while keeping the old syntax, **ONLY** the new version will be kept and a warning will be issued to alert you of the problem.For example, if you define both `quarkus.kubernetes.env-vars.my-env-var.value=foobar` and `quarkus.kubernetes.env.vars.my-env-var=newValue`, the extension will only generate an environment variable `MY_ENV_VAR=newValue` and issue a warning.
ja_jp: 古い文法を残した状態で新しい文法を使って同じ変数を再定義した場合、 新しいバージョン **のみ** が保持され、問題を通知するために警告が発せられます。例えば、 `quarkus.kubernetes.env-vars.my-env-var.value=foobar` と `quarkus.kubernetes.env.vars.my-env-var=newValue` の両方を定義した場合、エクステンションは環境変数 `MY_ENV_VAR=newValue` のみを生成して警告を発します。

source: If you redefine the same variable using the new syntax while keeping the old syntax, **ONLY** the new version will be kept, and a warning will be issued to alert you of the problem. For example, if you define both `quarkus.openshift.env-vars.my-env-var.value=foobar` and `quarkus.openshift.env.vars.my-env-var=newValue`, the extension will only generate an environment variable `MY_ENV_VAR=newValue` and issue a warning.
ja_jp: 古い構文を維持したまま新しい構文を使用して同じ変数を再定義した場合、新しいバージョン *のみ* が保持され、警告が表示されて問題を警告します。例えば、 `quarkus.openshift.env-vars.my-env-var.value=foobar` と `quarkus.openshift.env.vars.my-env-var=newValue` の両方を定義した場合、エクステンションは環境変数 `MY_ENV_VAR=newValue` のみを生成し、警告を発行します。

source: If you redeploy applications that you previously deployed by using `DeploymentConfig`, by default, those applications use `Deployment` but do not remove the previous `DeploymentConfig`. This leads to a deployment of both new and old applications, so, you must remove the old `DeploymentConfig` manually. If you want to continue to use `DeploymentConfig`, it is still possible to do so by explicitly setting `quarkus.openshift.deployment-kind` to `DeploymentConfig`.
ja_jp: 以前 `DeploymentConfig` を使用してデプロイしたアプリケーションを再デプロイする場合、デフォルトでは、それらのアプ リケーションは `Deployment` を使用しますが、以前の `DeploymentConfig` は削除されません。 これは新しいアプリケーションと古いアプリケーションの両方をデプロイすることになるため、古い `DeploymentConfig` を手動で削除する必要があります。 `DeploymentConfig` を使用し続けたい場合は、 `quarkus.openshift.deployment-kind` を `DeploymentConfig` に明示的に設定することで可能です。

source: If you register clients dynamically, on demand, as described in the <<register-clients-on-demand>> section, the problem of the duplicate client registration should not arise. You can persist the already registered client's registration URI and registration token if necessary though and check them too to avoid any duplicate reservation risk.
ja_jp: <<register-clients-on-demand>> セクションの説明に従ってクライアントを動的に必要に応じて登録する場合は、重複したクライアント登録の問題は発生しないはずです。 ただし、必要に応じて、すでに登録されているクライアントの登録 URI と登録トークンを保持し、それらを確認することで、重複した予約が発生するリスクを回避できます。

source: If you rerun the liveness health check procedure by accessing the `/q/health/live` endpoint you can see that the new health check `Health check with data` is present in the `checks` array. This check contains a new attribute called `data` which is a JSON object consisting of the properties we have defined in our health check procedure.
ja_jp: `/q/health/live` エンドポイントにアクセスしてLivenessヘルスチェック・プロシージャを再実行すると、新しいヘルスチェック `Health check with data` が `checks` 配列に存在していることがわかります。このチェックには、 `data` という新しい属性が含まれています。この属性は、ヘルスチェック手順で定義したプロパティで構成されるJSONオブジェクトです。

source: If you run Java 17+, records are a good fit for projection classes.
ja_jp: Java 17+を実行する場合、レコード型は投影クラスと相性が良いです。

source: If you run the *Infinispan Server image*, pass the `USER="admin"` and `PASS="password"` parameters.
ja_jp: *Infinispan サーバー イメージ* を実行する場合は、 `USER="admin"` と `PASS="password"` パラメータを渡します。

source: If you run the *bare metal distribution*, use the Command Line Interface (CLI) as follows:
ja_jp: *ベアメタルディストリビューション* を実行する場合は、次のようにコマンドラインインターフェイス（CLI）を使用します:
